### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # cloudflare_record.portal will be created
+   resource "cloudflare_record" "portal" {
+       allow_overwrite = false
+       created_on      = (known after apply)
+       hostname        = (known after apply)
+       id              = (known after apply)
+       metadata        = (known after apply)
+       modified_on     = (known after apply)
+       name            = "portal"
+       proxiable       = (known after apply)
+       ttl             = 1
+       type            = "CNAME"
+       value           = "giganticminecraft.github.io"
+       zone_id         = "77c10fdfa7c65de4d14903ed8879ebcb"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>